import torch


def en_to_ch(chinese_names, weights):
    """将英文标签训练好的权重文件，转换为中文标签"""
    weights_dict = torch.load(weights)

    # 将原来的英文标签，替换为中文标签
    weights_dict["model"].names = chinese_names

    # 最后保存到原文件中
    torch.save(weights_dict, weights)


if __name__ == "__main__":
    detect_list = ["人", "自行车", "汽车", "摩托车", "飞机", "公共汽车", "火车", "卡车", "船", "交通灯", "消防栓",
                   "停车标志", "停车计时器", "长凳", "鸟", "猫", "狗", "马", "羊", "牛", "大象", "熊", "斑马", "长颈鹿",
                   "背包", "雨伞", "手提包", "领带", "手提箱", "飞盘", "滑雪板", "滑雪板", "运动球", "风筝", "棒球棒",
                   "棒球手套", "滑板", "冲浪板", "网球拍", "瓶子", "酒杯", "杯子", "叉子", "刀", "勺子", "碗", "香蕉",
                   "苹果", "三明治", "橙子", "西兰花", "胡萝卜", "热狗", "披萨", "甜甜圈", "蛋糕", "椅子", "沙发",
                   "盆栽植物", "床", "餐桌", "厕所", "电视", "笔记本电脑", "鼠标", "远程", "键盘", "手机", "微波炉",
                   "烤箱", "烤面包机", "水槽", "冰箱", "书", "时钟", "花瓶", "剪刀", "泰迪熊", "吹风机", "牙刷"]
    fire_list = ["smoke", "fire"]

    en_to_ch(fire_list, "./weights/fire.pt")
